app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "All hail to the hypnotoad!!!"], ["image_file_name", "hypnotoad.jpeg"], ["image_updated_at", "2018-05-02 17:06:11.558102"], ["updated_at", "2018-05-02 17:06:11.618761"], ["id", 1]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)