app/controllers/tags_controller.rb

	def index
		@tag = Tag.all
---
SELECT "tags".* FROM "tags"